# Data Preprocessing

Data preprocessing is a key aspect of data preparation. It refers to any processing applied to raw data to ready it for further analysis or processing tasks. 

Traditionally, data preprocessing has been an essential preliminary step in data analysis. However, more recently, these techniques have been adapted to train machine learning and AI models and make inferences from them. 

Thus, data preprocessing may be defined as the process of converting raw data into a format that can be processed more efficiently and accurately in tasks such as: 

Data analysis
Machine learning 
Data science
AI

In [4]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

# Data Cleaning

Data cleaning is the process of identifying and correcting errors or inconsistencies in the data to ensure it is accurate and complete. The objective is to address issues that can distort analysis or model performance.

For example: 

Handling missing values: Using strategies like mean/mode imputation, deletion, or predictive models to fill in or remove missing data.

Removing duplicates: Eliminating duplicate records to ensure each entry is unique and relevant.

Correcting inconsistent formats: Standardizing formats (e.g., date formats, string cases) to maintain consistency.

In [26]:
# Creating Dataset
data = pd.DataFrame({
    'name' : ['John', 'Jane', 'Jack', 'John', None],
    'age' : [28, 34, None, 28, 22],
    'purchase_amount' : [100.5, None, 85.3, 100.5, 50.0],
    'date_of_purchase' : ['2023/12/01', '2023/12/02', '2023/12/01', '2023/12/01', '2023/12/03']
})

In [27]:
data.head()

   name   age  purchase_amount date_of_purchase
0  John  28.0            100.5       2023/12/01
1  Jane  34.0              NaN       2023/12/02
2  Jack   NaN             85.3       2023/12/01
3  John  28.0            100.5       2023/12/01
4  None  22.0             50.0       2023/12/03

In [28]:
# Handling missing values using mean imputation for 'age' and 'purchase_amount'
imputer = SimpleImputer(strategy = 'mean')
data[['age', 'purchase_amount']] = imputer.fit_transform(data[['age', 'purchase_amount']])

In [29]:
data.head()

   name   age  purchase_amount date_of_purchase
0  John  28.0          100.500       2023/12/01
1  Jane  34.0           84.075       2023/12/02
2  Jack  28.0           85.300       2023/12/01
3  John  28.0          100.500       2023/12/01
4  None  22.0           50.000       2023/12/03

In [30]:
# Removing Duplicate row
data = data.drop_duplicates()

In [31]:
data.head()

   name   age  purchase_amount date_of_purchase
0  John  28.0          100.500       2023/12/01
1  Jane  34.0           84.075       2023/12/02
2  Jack  28.0           85.300       2023/12/01
4  None  22.0           50.000       2023/12/03

In [32]:
# Correcting inconsistent date format
data['date_of_purchase'] = pd.to_datetime(data['date_of_purchase'], errors = 'coerce')

In [33]:
data.head()

   name   age  purchase_amount date_of_purchase
0  John  28.0          100.500       2023-12-01
1  Jane  34.0           84.075       2023-12-02
2  Jack  28.0           85.300       2023-12-01
4  None  22.0           50.000       2023-12-03

In [62]:
# Removing missing values
data.dropna(inplace=True)

data.head()

   name   age  purchase_amount date_of_purchase
0  John  28.0          100.500       2023-12-01
1  Jane  34.0           84.075       2023-12-02
2  Jack  28.0           85.300       2023-12-01

# Data Integration

Data integration involves combining data from multiple sources to create a unified dataset. This is often necessary when data is collected from different source systems.

Some techniques used in data integration include: 

Schema matching: Aligning fields and data structures from different sources to ensure consistency.

Data deduplication: Identifying and removing duplicate entries across multiple datasets.

In [34]:
# Creating two manual datasets
data1 = pd.DataFrame({
    'customer_id' : [1, 2, 3],
    'name' : ['John', 'Jane', 'Jack'],
    'age' : [28, 34, 29]
})

data2 = pd.DataFrame({
    'customer_id' : [1, 3, 4],
    'purchase_amount' : [100.5, 85.3, 45.0],
    'purchase_date' : ['2023-12-01', '2023-12-02', '2023-12-03']
})

In [37]:
data1.head()

   customer_id  name  age
0            1  John   28
1            2  Jane   34
2            3  Jack   29

In [38]:
data2.head()

   customer_id  purchase_amount purchase_date
0            1            100.5    2023-12-01
1            3             85.3    2023-12-02
2            4             45.0    2023-12-03

In [39]:
# Merging datasets on a common key 'customer_id'
merge_data = pd.merge(data1, data2, on='customer_id', how='inner')

In [40]:
merge_data.head()

   customer_id  name  age  purchase_amount purchase_date
0            1  John   28            100.5    2023-12-01
1            3  Jack   29             85.3    2023-12-02

# Data Transformation

Data transformation converts data into formats suitable for analysis, machine learning, or mining. 

For example: 

Scaling and normalization: Adjusting numeric values to a common scale is often necessary for algorithms that rely on distance metrics.

Encoding categorical variables: Converting categorical data into numerical values using one-hot or label encoding techniques.

Feature engineering and extraction: Creating new features or selecting important ones to improve model performance.

In [41]:
from sklearn.preprocessing import StandardScaler, OneHotEncoder

In [42]:
# Creating dataset
data3 = pd.DataFrame({
    'category' : ['A', 'B', 'A', 'C', 'B'],
    'numeric_column' : [10, 15, 10, 20, 15]
})

In [43]:
print(data3)

  category  numeric_column
0        A              10
1        B              15
2        A              10
3        C              20
4        B              15

In [44]:
# Scaling numeric data
scaler = StandardScaler()
data3['scaled_numeric_column'] = scaler.fit_transform(data3[['numeric_column']])

In [45]:
print(data3)

  category  numeric_column  scaled_numeric_column
0        A              10              -1.069045
1        B              15               0.267261
2        A              10              -1.069045
3        C              20               1.603567
4        B              15               0.267261

In [49]:
# Encoding categorical value
encoder = OneHotEncoder(sparse_output=False)
encoded_data = pd.DataFrame(encoder.fit_transform(data3[['category']]), columns=encoder.get_feature_names_out(['category']))

In [50]:
print(encoded_data)

   category_A  category_B  category_C
0         1.0         0.0         0.0
1         0.0         1.0         0.0
2         1.0         0.0         0.0
3         0.0         0.0         1.0
4         0.0         1.0         0.0

In [51]:
# Concatenating the encoded data with the original dataset
data3 = pd.concat([data3, encoded_data])

In [52]:
print(data3)

  category  numeric_column  scaled_numeric_column  category_A  category_B  \
0        A            10.0              -1.069045         NaN         NaN
1        B            15.0               0.267261         NaN         NaN
2        A            10.0              -1.069045         NaN         NaN
3        C            20.0               1.603567         NaN         NaN
4        B            15.0               0.267261         NaN         NaN
0      NaN             NaN                    NaN         1.0         0.0
1      NaN             NaN                    NaN         0.0         1.0
2      NaN             NaN                    NaN         1.0         0.0
3      NaN             NaN                    NaN         0.0         0.0
4      NaN             NaN                    NaN         0.0         1.0

   category_C
0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
0         0.0
1         0.0
2         0.0
3         1.0
4         0.0

# Data Reduction

Data reduction simplifies the dataset by reducing the number of features or records while preserving the essential information. This helps speed up analysis and model training without sacrificing accuracy.

Techniques for data reduction include: 

Feature selection: Choosing the most important features contributing to the analysis or model's performance.

Principal component analysis (PCA): A dimensionality reduction technique that transforms data into a lower-dimensional space.

Sampling methods: Reducing the size of the dataset by selecting representative samples is useful for handling large datasets.

In [53]:
from sklearn.decomposition import PCA
from sklearn.feature_selection import SelectKBest, chi2

In [54]:
# Creating Dataset
data4 = pd.DataFrame({
    'feature1' : [10, 20, 30, 40, 50],
    'feature2' : [1, 2, 3, 4, 5],
    'feature3' : [100, 200, 300, 400, 500],
    'target' : [0, 1, 0, 1, 0]
})

print(data4)

   feature1  feature2  feature3  target
0        10         1       100       0
1        20         2       200       1
2        30         3       300       0
3        40         4       400       1
4        50         5       500       0

In [58]:
# Feature Selection using SelectkBest
selector = SelectKBest(chi2, k=2)
selected_features = selector.fit_transform(data4[['feature1', 'feature2', 'feature3']], data4['target'])

print(selected_features)

[[  1 100]
 [  2 200]
 [  3 300]
 [  4 400]
 [  5 500]]

In [59]:
# Dimensionality reduction using PCA
pca = PCA(n_components=2)
pca_data = pca.fit_transform(data4[['feature1', 'feature2', 'feature3']])

print(pca_data)

[[-2.01007463e+02 -2.69618663e-15]
 [-1.00503731e+02  8.98728878e-16]
 [ 0.00000000e+00 -0.00000000e+00]
 [ 1.00503731e+02 -8.98728878e-16]
 [ 2.01007463e+02 -1.79745776e-15]]

# Handling missing data

Missing data can negatively impact the performance of a machine learning model or analysis. There are several strategies to handle missing values effectively:

Imputation: This technique involves filling in missing values with a calculated estimate, such as the mean, median, or mode of the available data. Advanced methods include predictive modeling, where missing values are predicted based on relationships within the data.

Deletion: Removing rows or columns with missing values is a straightforward solution. However, it should be used cautiously as it can lead to loss of valuable data, especially if many entries are missing.

Modeling missing values: In cases where the missing data pattern is more complex, machine learning models can predict the missing values based on the rest of the dataset. This can improve accuracy by incorporating relationships between different variables.

# Outlier detection and removal

Outliers are extreme values that deviate significantly from the rest of the data, which, like missing values, can distort analysis and model performance. Various techniques can be used to detect and handle outliers:

Z-Score method: This approach measures how many standard deviations a data point is from the mean. Data points beyond a certain threshold (e.g., ±3 standard deviations) can be considered outliers.

Interquartile range (IQR): IQR is the range between the first quartile (Q1) and the third quartile (Q3). Values beyond 1.5 times the IQR above Q3 or below Q1 are considered outliers.

Visual techniques: Visualization methods like box plots, scatter plots, or histograms can help detect outliers in a dataset. Once identified, outliers can either be removed or transformed, depending on their influence on the analysis.

# Data encoding

When working with categorical data, encoding is necessary to convert categories into numerical representations that machine learning algorithms can process. Common encoding techniques include:

One-hot encoding: As mentioned before, this method creates binary columns [0, 1] for each category.

Label encoding: Label encoding assigns a unique numerical value to each category. However, this method can introduce an unintended ordinal relationship between categories if they don’t have a natural order.

Ordinal encoding: Ordinal encoding is used when categorical variables have an inherent order, like low, medium, and high. Each category is mapped to a corresponding integer value that reflects its ranking.

# Data scaling and normalization

Scaling and normalization ensure that numerical features are on a similar scale, which is particularly important for algorithms that rely on distance metrics (e.g., k-nearest neighbors, SVMs).

Min-max scaling: This technique scales data to a specified range, typically 0 to 1. It's useful when all features need to have the same scale.

Standardization (Z-Score normalization): This method scales data such that the mean becomes 0 and the standard deviation becomes 1, helping models perform better with normally distributed features.

# Data augmentation

Data augmentation is a technique for artificially increasing the size of a dataset by creating new, synthetic examples. This is especially useful for image or text datasets in deep learning models, where large amounts of data are required for robust model performance.

Image augmentation: Techniques like rotating, flipping, scaling, or adding noise to images help create variations that improve model generalization.

Text augmentation: For text data, augmentation methods include synonym replacement, random insertion, and back-translation, where a sentence is translated into another language and then back into the original language, introducing variations.

# Tools for Data Preprocessing

While you can implement data processing using pure Python code, powerful tools have been developed to handle various tasks and make the overall process more efficient. Here are a few examples: 

1. Python libraries

There are quite a few specialized libraries for data preprocessing in Python. Here are 3 of the most popular: 

Pandas: Python's most commonly used library for data manipulation and cleaning. It provides flexible data structures, primarily DataFrame and Series, which enable you to handle and manipulate structured data efficiently. Pandas supports operations like handling missing data, merging datasets, filtering data, and reshaping.

NumPy: A fundamental library for numerical computations. It supports large, multi-dimensional arrays and matrices and mathematical functions to operate on these arrays. NumPy is often the foundation for many higher-level data processing libraries, such as Pandas.

Scikit-learn: Widely used for machine learning tasks but also offers numerous preprocessing utilities, such as scaling, encoding, and data transformation. Its preprocessing module contains tools for handling categorical data, scaling numerical data, feature extraction, and more.

2. Cloud platforms

On-premise systems may not be able to handle large datasets effectively. In such situations, cloud platforms offer scalable, efficient solutions that enable you to process vast amounts of data across distributed systems. 

Some cloud platform tools to consider include: 

AWS Glue: A fully managed ETL service by Amazon Web Services. It automatically discovers and organizes data and prepares it for analytics. Glue supports data cataloging and can connect to AWS services like S3 and Redshift.

Azure Data Factory: A cloud-based data integration service from Microsoft. It supports building ETL and ELT pipelines for large-scale data. Azure Data Factory allows users to move data between various services, preprocess it using transformations, and orchestrate workflows using a visual interface.